export const parttern = {
  email: /^(([a-zA-Z0-9_\-\.]+)@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.)|(([a-zA-Z0-9\-]+\.)+))([a-zA-Z]{2,4}|[0-9]{1,3})(\]?)(\s*;\s*|\s*$))*$/,
  // phone: /((^(\+84|0))+[3|5|7|8|9])+([0-9]{8})\b/,
  phone: /^[+]*[0-9]{7,15}$/,
  password: /^.{6,}$/,
  name: /^[^0-9]+$/,
  ho_va_ten: /[a-zA-Z]$/,
  only_number: /^[0-9]+$/,
  dob_ngay_thang_nam: /^(0[1-9]|1[0-9]|2[0-9]|3[0-1])[/](0[1-9]|1[0-2])[/](1[8-9]|2[0])\d{2}$|^(0[1-9]|1[0-2])[/](1[8-9]|2[0])\d{2}$|^(1[8-9]|2[0])\d{2}$/,
  insurrance_code: /^\d{10}$/,
  so_thang: /^\d{1,3}$/,
  bank_number: /^\d{1,50}$/,
  email_reg: /^[a-zA-Z0-9_]+[@](([a-zA-Z0-9_]+[.][a-zA-Z0-9_]+)|([a-zA-Z0-9_]+[.][a-zA-Z0-9_]+[.][a-zA-Z0-9_]{2,}))$/,
  full_name_vn: /^[a-z A-Z 'àáãạảăắằẳẵặâấầẩẫậèéẹẻẽêềếểễệđìíĩỉịòóõọỏôốồổỗộơớờởỡợùúũụủưứừửữựỳỵỷỹýÀÁÃẠẢĂẮẰẲẴẶÂẤẦẨẪẬÈÉẸẺẼÊỀẾỂỄỆĐÌÍĨỈỊÒÓÕỌỎÔỐỒỔỖỘƠỚỜỞỠỢÙÚŨỤỦƯỨỪỬỮỰỲỴỶỸÝ]+$/,
};

export const parttern_input = {
  input_form: /^[^!“#$%&‘()*;<=>?@[\]^_`{|}~]*$/
}
