export const parttern = {
  email: /^(([a-zA-Z0-9_\-\.]+)@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.)|(([a-zA-Z0-9\-]+\.)+))([a-zA-Z]{2,4}|[0-9]{1,3})(\]?)(\s*;\s*|\s*$))*$/,
  
  phone: /^[+]*[0-9]{10,11}$/,
  
  //cmt-can cuoc cong dan
  card_id9: /^[0-9]{9}$/,

  card_id12: /^[0-9]{12}$/,

  card_idHSM9: /^\w{9}(\w{3})?$/,

  cardid: /^([0-9]{12}|[0-9]{9}|([0-9]{10})(|)(-[0-9]{3}|))$/,
  
  password: /^.{6,}$/,
  name: /^[^0-9]+$/,
  name_and_number: /^[a-zA-Z0-9]+$/,
  ho_va_ten: /[a-zA-Z]$/,
  only_number: /^[0-9]+$/,
  dob_ngay_thang_nam: /^(0[1-9]|1[0-9]|2[0-9]|3[0-1])[/](0[1-9]|1[0-2])[/](1[8-9]|2[0])\d{2}$|^(0[1-9]|1[0-2])[/](1[8-9]|2[0])\d{2}$|^(1[8-9]|2[0])\d{2}$/,
  insurrance_code: /^\d{10}$/,
  so_thang: /^\d{1,3}$/,
  bank_number: /^\d{1,50}$/,
  email_reg: /^[a-zA-Z0-9_]+[@](([a-zA-Z0-9_]+[.][a-zA-Z0-9_]+)|([a-zA-Z0-9_]+[.][a-zA-Z0-9_]+[.][a-zA-Z0-9_]{2,}))$/,
  full_name_vn: /^[a-z A-Z 'àáãạảăắằẳẵặâấầẩẫậèéẹẻẽêềếểễệđìíĩỉịòóõọỏôốồổỗộơớờởỡợùúũụủưứừửữựỳỵỷỹýÀÁÃẠẢĂẮẰẲẴẶÂẤẦẨẪẬÈÉẸẺẼÊỀẾỂỄỆĐÌÍĨỈỊÒÓÕỌỎÔỐỒỔỖỘƠỚỜỞỠỢÙÚŨỤỦƯỨỪỬỮỰỲỴỶỸÝ]+$/,

};

export const parttern_input = {
  input_form: /^[^!“#$%&‘()*;<=>?@[\]^_`{|}~\\]*$/,
  number_form: /^([0-9]+)|([0-9.])$/,

  //ma so thue
  taxCode_form: /^([0-9]{10})(|)(-[0-9]{3}|)$/,

   //mật khẩu mạnh
   weak_pass: /^(?=.*[A-Z])(?=.*[a-z])(?=.*\d)(?=.*[!@#$%^&*()_+\-={};':\"\\|,.<>\\/?]).{8,}$/,

}
